In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
dict1= {'Name':['Arvind','Samar',np.nan,'Siri'],'Age':[np.nan,21,32,43],'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Name': ['Arvind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [7]:
d1=pd.DataFrame(dict1)
d1

     Name   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [9]:
d1.dtypes

Name     object
Age     float64
City     object
dtype: object

**Method 2***

In [12]:
dict2={'Name':['Arvind','Samar',None,'Siri'],'Age':[np.nan,21,32,43],'City':['Hyd','Blr','Chennai',None]}
dict2
d2=pd.DataFrame(dict2)
d2

     Name   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2    None  32.0  Chennai
3    Siri  43.0     None

In [14]:
d1.isnull()

    Name    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [15]:
d1.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

**How we know missing data %**

In [16]:
d1.isnull().sum()*100/len(d1)

Name    25.0
Age     25.0
City    25.0
dtype: float64

**Method- fillna**

In [18]:
d1.fillna(40)

     Name   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2      40  32.0  Chennai
3    Siri  43.0       40

In [22]:
d1['Age'].fillna(40)
d1

     Name   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [21]:
d1['Age'].fillna(40,inplace=True)
d1

     Name   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [23]:
d1['Name'].fillna('Pranjali',inplace=True)
d1

       Name   Age     City
0    Arvind  40.0      Hyd
1     Samar  21.0      Blr
2  Pranjali  32.0  Chennai
3      Siri  43.0      NaN

In [24]:
dict2={'Name':['Arvind','Samar',None,'Siri'],'Age':[np.nan,21,32,43],'City':['Hyd','Blr','Chennai',None]}
dict2
d2=pd.DataFrame(dict2)
d2

     Name   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2    None  32.0  Chennai
3    Siri  43.0     None

In [25]:
d1.fillna(method='bfill')

C:\Users\Pranjali\AppData\Local\Temp\ipykernel_8492\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

       Name   Age     City
0    Arvind  40.0      Hyd
1     Samar  21.0      Blr
2  Pranjali  32.0  Chennai
3      Siri  43.0      NaN